<!DOCTYPE html>
<html>
<head>
<title> 
Programacion, Departamento Fisica, FaCENA, UNNE
</title>
<style type="text/css">
<!-- @import url('/software/emacs/manual.css'); -->
@import url('../style.css');
</style>
</head>
<body>
<ul  class="navbar">
  <li class="navbar"><a class="active" href="index.html">Home</a></li>
  <li class="navbar"><a href="clases.html"> Clases</a></li>
  <li class="navbar"><a href="guias.html">Guias</a></li>
  <li class="navbar"><a href="bibliografia.html">Bibliografia</a></li>
</ul>


       <div class="article_content">
            <p><img src="unne.jpg" align="right" width="160" style="padding-right:40px;"/>
<br>
<b><FONT SIZE=6 COLOR= #008CBA> Asignatura </FONT></b><BR>
<bf>

<center>
<b><FONT SIZE=12 COLOR= #008CBA>  Programaci&oacute;n </FONT></b><BR>
</center>
<br>
<br>

Primer A&ntilde;o. Licenciatura en F&iacute;sica. <br>Departamento F&iacute;sica, FaCENA, UNNE
<hr>

<ul>
<!-- <li><h3><A HREF="programa.pdf"> Programa del curso </a> </h3> -->
</ul>

<br>

Profesor

<hr>


<ul>

  Prof  Manuel Pulido <br>

  Doctor en F&iacute;sica Universidad Nacional de C&oacute;rdoba. <br>

  1er Piso. FaCENA. Campus Deodoro Roca. Oficina GICA - <br> <!--CECONEA Centro Computos de Alto Rendimiento del NEA <br> -->
  
</ul>

<ul>

  JTP  Juan Jose Aucar.  <BR>

  Lic. en F&iacute;sica UNNE.  <br>
</ul>

  
<br>
Clases

<hr>
<ul>

D&iacute;as Jueves 14-18 - Debido a las restricciones por COVID-19, las clases ser&aacute;n por Google meet/Zoom <br>

</ul>

<br>
Material

<hr>
<ul>

  Es muy necesario tener una Laptop o PC de escritorio para poder cursar la materia. <br> <br>

  Cualquier PC aun una viejita y con especificaciones obsoletas sirve para la asignatura.<br> <br>

  Para aquellos solo con celular en forma temporaria intenten adquirir un teclado bluetooh. Pero practicar en una PC o Laptop es necesario para la asignatura. <br>

  </ul>
<br>
Primera actividad

<hr>
<ul>
  Los estudiantes deben crear una cuenta en gmail (google mail). <br>
  <br>


  El nombre del usuario (username) debe contener el apellido (obligatorio), el nombre y n&uacute;meros si es necesario. <br>
  <br>


  Idealmente ramon.rodriguez (pero pueden necesitar agregar mas identificatorios si la cuenta ya existe). <br>
  <br>


  <A HREF="https://accounts.google.com/signup/v2/webcreateaccount?flowName=GlifWebSignIn&flowEntry=SignUp"> Link para crearla </A>

  <br>
  <br>
  Una vez creada la cuenta deben escribir un correo electr&oacute;nico a la direcci&oacute;n de la asignatura: prog.fis.unne@gmail.com <br>
 <br>
  Enviar en el correo: <br>

  Apellido, Nombres, DNI, Nro Libreta Universitaria, Medio disponible (PC/Laptop/Tablet etc). Grupo que forma (3 estudiantes)
 <br>
  Esta cuenta ser&aacute; agregada a la lista de correos de la asignatura y debe ser utilizada para el envio de material. Por otro lado nos permitir&aacute; utilizar otras herramientas de comunicaci&oacute;n que tenemos previstas como google groups y slack. <br>
  </ul>
  
<br>
Programacion. Contexto. Python

<hr>
<ul>

  En ciencia es de utilidad el sistema operativo <b> Linux </b> este es un software de c&oacute;digo abierto y &uacute;til para grandes sistemas, multi-usuario, multi-tarea y de uso intensivo de la red. En la asignatura uno de los objetivos es aprender la esencia de linux.
  <br>
  <br>
  Para la programaci&oacute;n cient&iacute;fica hay dos grandes tipos de lenguajes los int&eacute;rpretes (scripting) y los compilables. Del primer grupo se pueden citar a python y R (de c&oacute;digo abierto), IDL y Matlab (pagos). Mientras del segundo grupo podemos citar a Fortran y C.
  <br>
  <br>

  
  En la asignatura aprenderemos a programar a trav&eacute;s del lenguaje <b> Python </b>. <br>

  Es un lenguaje relativamente reciente que ha crecido enormemente en la &uacute;ltima d&eacute;cada. Gran parte de las aplicaciones en inteligencia artificial, aprendizaje automatizado se encuentran desarrolladas en python. <br>

  <br>
  Python fue creado por <A HREF="https://en.wikipedia.org/wiki/Guido_van_Rossum">  Guido vanRossum</a>, un programador holandes en 1991. La historia de python puede ser le&iacute;da <A HREF="https://en.wikipedia.org/wiki/Python_(programming_language)"> aqui  </a>
 <br>
 Python es el lenguaje actualmente mas utilizado para el aprendizaje de programacion. Esto se debe a sus principales caracter&iacute;sticas:
 <ul>
 <li> F&aacute;cil e intuitivo.
  <li> Es de c&oacute;digo abierto.
  <li> Posee una gran cantidad de usuarios, de librer&iacute;as disponibles y por ende de foros e.g. stackoverflow (sitio web de preguntas y respuestas de lenguajes). 
 
 </ul>
<br>
<b> Otras herramientas que deben aprender a utilizar: </b> <br>

<li> Terminal o consola. Lenguaje shell / bash. Manejo de archivos y administrar la computadora en general.<br>

<li> Editor de textos (para programar). Nano, Notepad (simples), mas especializados: vi, emacs.   Microsoft Word NO sirve.<br>

<li> Procesador de textos. Para f&oacute;rmulas matem&aacute;ticas se utiliza el LaTeX.  Para una introducci&oacute;n ver este  <A HREF="latex_fil.pdf">  material de un taller de latex. </a>


<li>   Otro procesador de textos mas sencillo que es de utilidad: markdown (Si no hay mas remedio: LibreOffice o Microsoft Word).
  <br>
  <br>
  Como ejemplo del software que uso: <ul><li> Sistema operativo: linux (distribuci&oacute;n opensuse).<br> <li>Administrador de ventanas: ion, es uno ultrasimple y muy liviano. Para principiantes se recomienda gnome/kde. <br> <li> Terminal: bash, screen.<br> <li> Editor de textos: emacs. <br> <li> Lenguajes principales: fortran y python. <br> <li> Procesador de textos: latex.<br> <li> Herramienta para reproducible research que combina m&uacute;ltiples lenguajes de programaci&oacute;n,  textos y figuras: org-mode.<br> <li>  Para ver archivos pdf: okular. Para ver figuras: gwenview<br> <li> Versionador de software: git. (repositorios: gitlab, github, bitbucket). <br> <li> Navegadores: firefox, chrome, lynx.<br> <li> Herramientas HPC: openmpi, ganglia, torque.
 </ul>
 </ul>
<hr>


</div>
<p style="font-size:14px"> Manuel Pulido <A HREF="https://pulidom.github.io/"> Mi pagina web </a>  </p>
<p style="font-size:12px"> 13 Aug 2020 </p>
</body>
</html>


